Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange class defines the expected amount of model object inputs for the picker..

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange.MaxCap
The maximum cap.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange.#ctor(System.UInt32,System.UInt32)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange class.
min: The minimum.
max: The maximum.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange.Minimum
Gets the minimum input amount.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange.Maximum
Gets the maximum input amount.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange.Exactly(System.UInt32)
Factory method for specifying an exact input amount.
inputAmount: The input amount.
Returns: An Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange instance.
Throws System.ArgumentException: Throws a System.ArgumentException if inputAmount > 99.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange.InRangeOf(System.UInt32,System.UInt32)
Factory method for specifying input amount in a certain range.
minAmount: The minimum amount.
maxAmount: The maximum amount.
Returns: An Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange instance.
Throws System.ArgumentException:
Throws a System.ArgumentException if minAmount > maxAmount,
or if maxAmount is > 99.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange.AtMost(System.UInt32)
Factory method for specifying an input amount with an upper limit.
inputAmount: The input amount.
Returns: An Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange instance.
Throws System.ArgumentException: Throws a System.ArgumentException if inputAmount > 99.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange.AtLeast(System.UInt32)
Factory method for specifying an input amount with a lower limit.
inputAmount: The input amount.
Returns:
An Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange instance.
Throws System.ArgumentException: Throws a System.ArgumentException if inputAmount > 99.